SeanTheSheepCS/MSP430_SmallMotorCar/io430x21x2.h

/********************************************************************
 *
 * Standard register and bit definitions for the Texas Instruments
 * MSP430 microcontroller.
 *
 * This file supports assembler and C/EC++ development for
 * MSP430x21x2 devices.
 *
 * Copyright 1996-2008 IAR Systems. All rights reserved.
 *
 * $Revision: 4349 $
 *
 ********************************************************************/

#ifndef __IO430X21X2
#define __IO430X21X2

#ifdef  __IAR_SYSTEMS_ICC__
#ifndef _SYSTEM_BUILD
#pragma system_include
#endif
#endif

#if (((__TID__ >> 8) & 0x7F) != 0x2b)     /* 0x2b = 43 dec */
#error io430x21x2.h file for use with ICC430/A430 only
#endif

 
#ifdef __IAR_SYSTEMS_ICC__
#pragma language=extended
#pragma system_include

#ifdef __cplusplus
#define __READ    /* not supported */
#else
#define __READ    const
#endif


/*-------------------------------------------------------------------------
 *   Standard Bits
 *-------------------------------------------------------------------------*/

#define BIT0                (0x0001)
#define BIT1                (0x0002)
#define BIT2                (0x0004)
#define BIT3                (0x0008)
#define BIT4                (0x0010)
#define BIT5                (0x0020)
#define BIT6                (0x0040)
#define BIT7                (0x0080)
#define BIT8                (0x0100)
#define BIT9                (0x0200)
#define BITA                (0x0400)
#define BITB                (0x0800)
#define BITC                (0x1000)
#define BITD                (0x2000)
#define BITE                (0x4000)
#define BITF                (0x8000)

/*-------------------------------------------------------------------------
 *   Status register bits
 *-------------------------------------------------------------------------*/

#define C                   (0x0001)
#define Z                   (0x0002)
#define N                   (0x0004)
#define V                   (0x0100)
#define GIE                 (0x0008)
#define CPUOFF              (0x0010)
#define OSCOFF              (0x0020)
#define SCG0                (0x0040)
#define SCG1                (0x0080)

/* Low Power Modes coded with Bits 4-7 in SR */

#define LPM0_bits           (CPUOFF)
#define LPM1_bits           (SCG0+CPUOFF)
#define LPM2_bits           (SCG1+CPUOFF)
#define LPM3_bits           (SCG1+SCG0+CPUOFF)
#define LPM4_bits           (SCG1+SCG0+OSCOFF+CPUOFF)


#define LPM0      _BIS_SR(LPM0_bits)     /* Enter Low Power Mode 0 */
#define LPM0_EXIT _BIC_SR_IRQ(LPM0_bits) /* Exit Low Power Mode 0 */
#define LPM1      _BIS_SR(LPM1_bits)     /* Enter Low Power Mode 1 */
#define LPM1_EXIT _BIC_SR_IRQ(LPM1_bits) /* Exit Low Power Mode 1 */
#define LPM2      _BIS_SR(LPM2_bits)     /* Enter Low Power Mode 2 */
#define LPM2_EXIT _BIC_SR_IRQ(LPM2_bits) /* Exit Low Power Mode 2 */
#define LPM3      _BIS_SR(LPM3_bits)     /* Enter Low Power Mode 3 */
#define LPM3_EXIT _BIC_SR_IRQ(LPM3_bits) /* Exit Low Power Mode 3 */
#define LPM4      _BIS_SR(LPM4_bits)     /* Enter Low Power Mode 4 */
#define LPM4_EXIT _BIC_SR_IRQ(LPM4_bits) /* Exit Low Power Mode 4 */



/*-------------------------------------------------------------------------
 *   Special Function
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char IE1;  /* Interrupt Enable 1 */ 
  
  struct
  {
    unsigned char WDTIE          : 1;  /* Watchdog Interrupt Enable */ 
    unsigned char OFIE           : 1;  /* Osc. Fault  Interrupt Ena */ 
    unsigned char                : 2; 
    unsigned char NMIIE          : 1;  /* NMI Interrupt Enable */ 
    unsigned char ACCVIE         : 1;  /* Flash Access Violation Interrupt Enable */ 
  } IE1_bit;  
} @ 0x0000;


enum {
  WDTIE               = 0x0001,
  OFIE                = 0x0002,
  NMIIE               = 0x0010,
  ACCVIE              = 0x0020,
};


__no_init volatile union
{
  unsigned char IFG1;  /* Interrupt Flag 1 */ 
  
  struct
  {
    unsigned char WDTIFG         : 1;  /* Watchdog Interrupt Flag */ 
    unsigned char OFIFG          : 1;  /* Osc. Fault Interrupt Flag */ 
    unsigned char PORIFG         : 1;  /* Power On Interrupt Flag */ 
    unsigned char RSTIFG         : 1;  /* Reset Interrupt Flag */ 
    unsigned char NMIIFG         : 1;  /* Watchdog Interrupt Enable */ 
  } IFG1_bit;  
} @ 0x0002;


enum {
  WDTIFG              = 0x0001,
  OFIFG               = 0x0002,
  PORIFG              = 0x0004,
  RSTIFG              = 0x0008,
  NMIIFG              = 0x0010,
};


__no_init volatile union
{
  unsigned char IE2;  /* Interrupt Enable 2 */ 
  
  struct
  {
    unsigned char UCA0RXIE       : 1; 
    unsigned char UCA0TXIE       : 1; 
    unsigned char UCB0RXIE       : 1; 
    unsigned char UCB0TXIE       : 1; 
  } IE2_bit;  
} @ 0x0001;


enum {
  UCA0RXIE            = 0x0001,
  UCA0TXIE            = 0x0002,
  UCB0RXIE            = 0x0004,
  UCB0TXIE            = 0x0008,
};


__no_init volatile union
{
  unsigned char IFG2;  /* Interrupt Flag 2 */ 
  
  struct
  {
    unsigned char UCA0RXIFG      : 1; 
    unsigned char UCA0TXIFG      : 1; 
    unsigned char UCB0RXIFG      : 1; 
    unsigned char UCB0TXIFG      : 1; 
  } IFG2_bit;  
} @ 0x0003;


enum {
  UCA0RXIFG           = 0x0001,
  UCA0TXIFG           = 0x0002,
  UCB0RXIFG           = 0x0004,
  UCB0TXIFG           = 0x0008,
};



/*-------------------------------------------------------------------------
 *   ADC10
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char ADC10DTC0;  /* ADC10 Data Transfer Control 0 */ 
  
  struct
  {
    unsigned char ADC10FETCH     : 1; 
    unsigned char ADC10B1        : 1; 
    unsigned char ADC10CT        : 1; 
    unsigned char ADC10TB        : 1; 
  } ADC10DTC0_bit;  
} @ 0x0048;


enum {
  ADC10FETCH          = 0x0001,
  ADC10B1             = 0x0002,
  ADC10CT             = 0x0004,
  ADC10TB             = 0x0008,
};


 /* ADC10 Data Transfer Control 1 */ 
__no_init volatile unsigned char ADC10DTC1 @ 0x0049;  
 

 /* ADC10 Analog Enable 0 */ 
__no_init volatile unsigned char ADC10AE0 @ 0x004A;  
 

 /* ADC10 Analog Enable 1 */ 
__no_init volatile unsigned char ADC10AE1 @ 0x004B;  
 

