SeanTheSheepCS/MSP430_SmallMotorCar/io430x21x2.h
__no_init volatile union
{
  unsigned short ADC10CTL0;  /* ADC10 Control 0 */ 
  
  struct
  {
    unsigned short ADC10SC       : 1;  /* ADC10 Start Conversion */ 
    unsigned short ENC           : 1;  /* ADC10 Enable Conversion */ 
    unsigned short ADC10IFG      : 1;  /* ADC10 Interrupt Flag */ 
    unsigned short ADC10IE       : 1;  /* ADC10 Interrupt Enalbe */ 
    unsigned short ADC10ON       : 1;  /* ADC10 On/Enable */ 
    unsigned short REFON         : 1;  /* ADC10 Reference on */ 
    unsigned short REF2_5V       : 1;  /* ADC10 Ref 0:1.5V / 1:2.5V */ 
    unsigned short MSC           : 1;  /* ADC10 Multiple SampleConversion */ 
    unsigned short REFBURST      : 1;  /* ADC10 Reference Burst Mode */ 
    unsigned short REFOUT        : 1;  /* ADC10 Enalbe output of Ref. */ 
    unsigned short ADC10SR       : 1;  /* ADC10 Sampling Rate 0:200ksps / 1:50ksps */ 
    unsigned short ADC10SHT      : 2;  /* ADC10 Sample Hold Select */ 
    unsigned short ADC10SREF     : 3;  /* ADC10 Reference Select */ 
  } ADC10CTL0_bit;  
} @ 0x01B0;


enum {
  ADC10SC             = 0x0001,
  ENC                 = 0x0002,
  ADC10IFG            = 0x0004,
  ADC10IE             = 0x0008,
  ADC10ON             = 0x0010,
  REFON               = 0x0020,
  REF2_5V             = 0x0040,
  MSC                 = 0x0080,
  REFBURST            = 0x0100,
  REFOUT              = 0x0200,
  ADC10SR             = 0x0400,
  ADC10SHT            = 0x1000,
  ADC10SREF           = 0x8000,
};


__no_init volatile union
{
  unsigned short ADC10CTL1;  /* ADC10 Control 1 */ 
  
  struct
  {
    unsigned short ADC10BUSY     : 1;  /*  */ 
    unsigned short ADC10CONSEQ   : 2;  /* ADC10 Conversion Sequence Select */ 
    unsigned short ADC10SSEL     : 2;  /* ADC10 Clock Source Select */ 
    unsigned short ADC10DIV      : 3;  /* ADC10 Clock Divider Select */ 
    unsigned short ISSH          : 1;  /* ADC10 Invert Sample Hold Signal */ 
    unsigned short ADC10DF       : 1;  /* ADC10 Data Format 0:binary 1:2's complement */ 
    unsigned short SHS           : 2;  /* ADC10 Sample/Hold Source */ 
    unsigned short INCH          : 4;  /* ADC10 Input Channel Select */ 
  } ADC10CTL1_bit;  
} @ 0x01B2;


enum {
  ADC10BUSY           = 0x0001,
  ADC10CONSEQ         = 0x0004,
  ADC10SSEL           = 0x0010,
  ADC10DIV            = 0x0080,
  ISSH                = 0x0100,
  ADC10DF             = 0x0200,
  SHS                 = 0x0800,
  INCH                = 0x8000,
};


 /* DC10 Memory */ 
__no_init volatile unsigned short ADC10MEM @ 0x01B4;  
 

 /* ADC10 Data Transfer Start Address */ 
__no_init volatile unsigned short ADC10SA @ 0x01BC;  
 
 
#define __MSP430_HAS_ADC10__         /* Definition to show that Module is available */
#define ADC10DISABLE    (0x000)      /* ADC10DTC1 */
#define ADC10SHT_0      (0*0x800u)   /* 4 x ADC10CLKs */
#define ADC10SHT_1      (1*0x800u)   /* 8 x ADC10CLKs */
#define ADC10SHT_2      (2*0x800u)   /* 16 x ADC10CLKs */
#define ADC10SHT_3      (3*0x800u)   /* 64 x ADC10CLKs */

#define SREF_0          (0*0x2000u)  /* VR+ = AVCC and VR- = AVSS */
#define SREF_1          (1*0x2000u)  /* VR+ = VREF+ and VR- = AVSS */
#define SREF_2          (2*0x2000u)  /* VR+ = VEREF+ and VR- = AVSS */
#define SREF_3          (3*0x2000u)  /* VR+ = VEREF+ and VR- = AVSS */
#define SREF_4          (4*0x2000u)  /* VR+ = AVCC and VR- = VREF-/VEREF- */
#define SREF_5          (5*0x2000u)  /* VR+ = VREF+ and VR- = VREF-/VEREF- */
#define SREF_6          (6*0x2000u)  /* VR+ = VEREF+ and VR- = VREF-/VEREF- */
#define SREF_7          (7*0x2000u)  /* VR+ = VEREF+ and VR- = VREF-/VEREF- */

#define CONSEQ_0        (0*2u)       /* Single channel single conversion */
#define CONSEQ_1        (1*2u)       /* Sequence of channels */
#define CONSEQ_2        (2*2u)       /* Repeat single channel */
#define CONSEQ_3        (3*2u)       /* Repeat sequence of channels */

#define ADC10SSEL_0     (0*8u)       /* ADC10OSC */
#define ADC10SSEL_1     (1*8u)       /* ACLK */
#define ADC10SSEL_2     (2*8u)       /* MCLK */
#define ADC10SSEL_3     (3*8u)       /* SMCLK */

#define ADC10DIV_0      (0*0x20u)
#define ADC10DIV_1      (1*0x20u)
#define ADC10DIV_2      (2*0x20u)
#define ADC10DIV_3      (3*0x20u)
#define ADC10DIV_4      (4*0x20u)
#define ADC10DIV_5      (5*0x20u)
#define ADC10DIV_6      (6*0x20u)
#define ADC10DIV_7      (7*0x20u)

#define SHS_0           (0*0x400u)   /* ADC10SC */
#define SHS_1           (1*0x400u)   /* TA3 OUT1 */
#define SHS_2           (2*0x400u)   /* TA3 OUT0 */
#define SHS_3           (3*0x400u)   /* TA3 OUT2 */

#define INCH_0          (0*0x1000u)
#define INCH_1          (1*0x1000u)
#define INCH_2          (2*0x1000u)
#define INCH_3          (3*0x1000u)
#define INCH_4          (4*0x1000u)
#define INCH_5          (5*0x1000u)
#define INCH_6          (6*0x1000u)
#define INCH_7          (7*0x1000u)
#define INCH_8          (8*0x1000u)
#define INCH_9          (9*0x1000u)
#define INCH_10         (10*0x1000u)
#define INCH_11         (11*0x1000u)
#define INCH_12         (12*0x1000u) /* Selects Channel 11 */
#define INCH_13         (13*0x1000u) /* Selects Channel 11 */
#define INCH_14         (14*0x1000u) /* Selects Channel 11 */
#define INCH_15         (15*0x1000u) /* Selects Channel 11 */

#define ADC10AE         ADC10AE0    /* ADC10 Analog Enable */


 

/*-------------------------------------------------------------------------
 *   Basic Clock Module
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char DCOCTL;  /* DCO Clock Frequency Control */ 
  
  struct
  {
    unsigned char MOD0           : 1;  /* Modulation Bit 0 */ 
    unsigned char MOD1           : 1;  /* Modulation Bit 1 */ 
    unsigned char MOD2           : 1;  /* Modulation Bit 2 */ 
    unsigned char MOD3           : 1;  /* Modulation Bit 3 */ 
    unsigned char MOD4           : 1;  /* Modulation Bit 4 */ 
    unsigned char DCO0           : 1;  /* DCO Select Bit 0 */ 
    unsigned char DCO1           : 1;  /* DCO Select Bit 1 */ 
    unsigned char DCO2           : 1;  /* DCO Select Bit 2 */ 
  } DCOCTL_bit;  
} @ 0x0056;


enum {
  MOD0                = 0x0001,
  MOD1                = 0x0002,
  MOD2                = 0x0004,
  MOD3                = 0x0008,
  MOD4                = 0x0010,
  DCO0                = 0x0020,
  DCO1                = 0x0040,
  DCO2                = 0x0080,
};


