SeanTheSheepCS/MSP430_SmallMotorCar/io430x21x2.h
__no_init volatile union
{
  unsigned char BCSCTL1;  /* Basic Clock System Control 1 */ 
  
  struct
  {
    unsigned char RSEL0          : 1;  /* Range Select Bit 0 */ 
    unsigned char RSEL1          : 1;  /* Range Select Bit 1 */ 
    unsigned char RSEL2          : 1;  /* Range Select Bit 2 */ 
    unsigned char RSEL3          : 1;  /* Range Select Bit 3 */ 
    unsigned char DIVA0          : 1;  /* ACLK Divider 0 */ 
    unsigned char DIVA1          : 1;  /* ACLK Divider 1 */ 
    unsigned char XTS            : 1;  /* LFXTCLK 0:Low Freq. / 1: High Freq. */ 
    unsigned char XT2OFF         : 1;  /* Enable XT2CLK */ 
  } BCSCTL1_bit;  
} @ 0x0057;


enum {
  RSEL0               = 0x0001,
  RSEL1               = 0x0002,
  RSEL2               = 0x0004,
  RSEL3               = 0x0008,
  DIVA0               = 0x0010,
  DIVA1               = 0x0020,
  XTS                 = 0x0040,
  XT2OFF              = 0x0080,
};


__no_init volatile union
{
  unsigned char BCSCTL2;  /* Basic Clock System Control 2 */ 
  
  struct
  {
    unsigned char DCOR           : 1;  /* Enable External Resistor : 1 */ 
    unsigned char DIVS0          : 1;  /* SMCLK Divider 0 */ 
    unsigned char DIVS1          : 1;  /* SMCLK Divider 1 */ 
    unsigned char SELS           : 1;  /* SMCLK Source Select 0:DCOCLK / 1:XT2CLK/LFXTCLK */ 
    unsigned char DIVM0          : 1;  /* CLK Divider 0 */ 
    unsigned char DIVM1          : 1;  /* CLK Divider 1 */ 
    unsigned char SELM0          : 1;  /* MCLK Source Select 0 */ 
    unsigned char SELM1          : 1;  /* MCLK Source Select 1 */ 
  } BCSCTL2_bit;  
} @ 0x0058;


enum {
  DCOR                = 0x0001,
  DIVS0               = 0x0002,
  DIVS1               = 0x0004,
  SELS                = 0x0008,
  DIVM0               = 0x0010,
  DIVM1               = 0x0020,
  SELM0               = 0x0040,
  SELM1               = 0x0080,
};


__no_init volatile union
{
  unsigned char BCSCTL3;  /* Basic Clock System Control 3 */ 
  
  struct
  {
    unsigned char LFXT1OF        : 1;  /* Low/high Frequency Oscillator Fault Flag */ 
    unsigned char XT2OF          : 1;  /* High frequency oscillator 2 fault flag */ 
    unsigned char XCAP0          : 1;  /* XIN/XOUT Cap 0 */ 
    unsigned char XCAP1          : 1;  /* XIN/XOUT Cap 1 */ 
    unsigned char LFXT1S0        : 1;  /* Mode 0 for LFXT1 (XTS = 0) */ 
    unsigned char LFXT1S1        : 1;  /* Mode 1 for LFXT1 (XTS = 0) */ 
    unsigned char XT2S0          : 1;  /* Mode 0 for XT2 */ 
    unsigned char XT2S1          : 1;  /* Mode 1 for XT2 */ 
  } BCSCTL3_bit;  
} @ 0x0053;


enum {
  LFXT1OF             = 0x0001,
  XT2OF               = 0x0002,
  XCAP0               = 0x0004,
  XCAP1               = 0x0008,
  LFXT1S0             = 0x0010,
  LFXT1S1             = 0x0020,
  XT2S0               = 0x0040,
  XT2S1               = 0x0080,
};

 
#define __MSP430_HAS_BC2__           /* Definition to show that Module is available */

#define DIVA_0              (0x00)   /* ACLK Divider 0: /1 */
#define DIVA_1              (0x10)   /* ACLK Divider 1: /2 */
#define DIVA_2              (0x20)   /* ACLK Divider 2: /4 */
#define DIVA_3              (0x30)   /* ACLK Divider 3: /8 */

#define DIVS_0              (0x00)   /* SMCLK Divider 0: /1 */
#define DIVS_1              (0x02)   /* SMCLK Divider 1: /2 */
#define DIVS_2              (0x04)   /* SMCLK Divider 2: /4 */
#define DIVS_3              (0x06)   /* SMCLK Divider 3: /8 */

#define DIVM_0              (0x00)   /* MCLK Divider 0: /1 */
#define DIVM_1              (0x10)   /* MCLK Divider 1: /2 */
#define DIVM_2              (0x20)   /* MCLK Divider 2: /4 */
#define DIVM_3              (0x30)   /* MCLK Divider 3: /8 */

#define SELM_0              (0x00)   /* MCLK Source Select 0: DCOCLK */
#define SELM_1              (0x40)   /* MCLK Source Select 1: DCOCLK */
#define SELM_2              (0x80)   /* MCLK Source Select 2: XT2CLK/LFXTCLK */
#define SELM_3              (0xC0)   /* MCLK Source Select 3: LFXTCLK */

#define XCAP_0              (0x00)   /* XIN/XOUT Cap : 0 pF */
#define XCAP_1              (0x04)   /* XIN/XOUT Cap : 6 pF */
#define XCAP_2              (0x08)   /* XIN/XOUT Cap : 10 pF */
#define XCAP_3              (0x0C)   /* XIN/XOUT Cap : 12.5 pF */

#define LFXT1S_0            (0x00)   /* Mode 0 for LFXT1 : Normal operation */
#define LFXT1S_1            (0x10)   /* Mode 1 for LFXT1 : Reserved */
#define LFXT1S_2            (0x20)   /* Mode 2 for LFXT1 : VLO */
#define LFXT1S_3            (0x30)   /* Mode 3 for LFXT1 : Digital input signal */

#define XT2S_0              (0x00)   /* Mode 0 for XT2 : 0.4 - 1 MHz */
#define XT2S_1              (0x40)   /* Mode 1 for XT2 : 1 - 4 MHz */
#define XT2S_2              (0x80)   /* Mode 2 for XT2 : 2 - 16 MHz */
#define XT2S_3              (0xC0)   /* Mode 3 for XT2 : Digital input signal */
 

/*-------------------------------------------------------------------------
 *   Comparator A
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char CACTL1;  /* Comparator A Control 1 */ 
  
  struct
  {
    unsigned char CAIFG          : 1;  /* Comp. A Interrupt Flag */ 
    unsigned char CAIE           : 1;  /* Comp. A Interrupt Enable */ 
    unsigned char CAIES          : 1;  /* Comp. A Int. Edge Select: 0:rising / 1:falling */ 
    unsigned char CAON           : 1;  /* Comp. A enable */ 
    unsigned char CAREF0         : 1;  /* Comp. A Internal Reference Select 0 */ 
    unsigned char CAREF1         : 1;  /* Comp. A Internal Reference Select 1 */ 
    unsigned char CARSEL         : 1;  /* Comp. A Internal Reference Enable */ 
    unsigned char CAEX           : 1;  /* Comp. A Exchange Inputs */ 
  } CACTL1_bit;  
} @ 0x0059;


enum {
  CAIFG               = 0x0001,
  CAIE                = 0x0002,
  CAIES               = 0x0004,
  CAON                = 0x0008,
  CAREF0              = 0x0010,
  CAREF1              = 0x0020,
  CARSEL              = 0x0040,
  CAEX                = 0x0080,
};


