SeanTheSheepCS/MSP430_SmallMotorCar/io430x21x2.h
__no_init volatile union
{
  unsigned short TACCTL2;  /* Timer A Capture/Compare Control 2 */ 
  
  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */ 
    unsigned short COV           : 1;  /* Capture/compare overflow flag */ 
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */ 
    unsigned short CCI           : 1;  /* Capture input signal (read) */ 
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */ 
    unsigned short OUTMOD        : 3;  /* Output mode */ 
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */ 
    unsigned short               : 1; 
    unsigned short SCCI          : 1;  /* Latched capture signal (read) */ 
    unsigned short SCS           : 1;  /* Capture sychronize */ 
    unsigned short CCIS          : 2;  /* Capture input select */ 
    unsigned short CM            : 2;  /* Capture mode */ 
  } TACCTL2_bit;  
} @ 0x0166;




 /* Timer A */ 
__no_init volatile unsigned short TAR @ 0x0170;  
 

 /* Timer A Capture/Compare 0 */ 
__no_init volatile unsigned short TACCR0 @ 0x0172;  
 

 /* Timer A Capture/Compare 1 */ 
__no_init volatile unsigned short TACCR1 @ 0x0174;  
 

 /* Timer A Capture/Compare 2 */ 
__no_init volatile unsigned short TACCR2 @ 0x0176;  
 
 
#define __MSP430_HAS_TA3__         /* Definition to show that Module is available */

#define MC_0            (0*0x10u)  /* Timer A mode control: 0 - Stop */
#define MC_1            (1*0x10u)  /* Timer A mode control: 1 - Up to CCR0 */
#define MC_2            (2*0x10u)  /* Timer A mode control: 2 - Continous up */
#define MC_3            (3*0x10u)  /* Timer A mode control: 3 - Up/Down */
#define ID_0            (0*0x40u)  /* Timer A input divider: 0 - /1 */
#define ID_1            (1*0x40u)  /* Timer A input divider: 1 - /2 */
#define ID_2            (2*0x40u)  /* Timer A input divider: 2 - /4 */
#define ID_3            (3*0x40u)  /* Timer A input divider: 3 - /8 */
#define TASSEL_0        (0*0x100u) /* Timer A clock source select: 0 - TACLK */
#define TASSEL_1        (1*0x100u) /* Timer A clock source select: 1 - ACLK  */
#define TASSEL_2        (2*0x100u) /* Timer A clock source select: 2 - SMCLK */
#define TASSEL_3        (3*0x100u) /* Timer A clock source select: 3 - INCLK */

#define OUTMOD_0        (0*0x20u)  /* PWM output mode: 0 - output only */
#define OUTMOD_1        (1*0x20u)  /* PWM output mode: 1 - set */
#define OUTMOD_2        (2*0x20u)  /* PWM output mode: 2 - PWM toggle/reset */
#define OUTMOD_3        (3*0x20u)  /* PWM output mode: 3 - PWM set/reset */
#define OUTMOD_4        (4*0x20u)  /* PWM output mode: 4 - toggle */
#define OUTMOD_5        (5*0x20u)  /* PWM output mode: 5 - Reset */
#define OUTMOD_6        (6*0x20u)  /* PWM output mode: 6 - PWM toggle/set */
#define OUTMOD_7        (7*0x20u)  /* PWM output mode: 7 - PWM reset/set */
#define CCIS_0          (0*0x1000u) /* Capture input select: 0 - CCIxA */
#define CCIS_1          (1*0x1000u) /* Capture input select: 1 - CCIxB */
#define CCIS_2          (2*0x1000u) /* Capture input select: 2 - GND */
#define CCIS_3          (3*0x1000u) /* Capture input select: 3 - Vcc */
#define CM_0            (0*0x4000u) /* Capture mode: 0 - disabled */
#define CM_1            (1*0x4000u) /* Capture mode: 1 - pos. edge */
#define CM_2            (2*0x4000u) /* Capture mode: 1 - neg. edge */
#define CM_3            (3*0x4000u) /* Capture mode: 1 - both edges */

/* Alternate register names */
#define CCTL0           TACCTL0   /* Timer A Capture/Compare Control 0 */
#define CCTL1           TACCTL1   /* Timer A Capture/Compare Control 1 */
#define CCTL2           TACCTL2   /* Timer A Capture/Compare Control 2 */
#define CCR0            TACCR0    /* Timer A Capture/Compare 0 */
#define CCR1            TACCR1    /* Timer A Capture/Compare 1 */
#define CCR2            TACCR2    /* Timer A Capture/Compare 2 */
#define CCTL0_          TACCTL0   /* Timer A Capture/Compare Control 0 */
#define CCTL1_          TACCTL1   /* Timer A Capture/Compare Control 1 */
#define CCTL2_          TACCTL2   /* Timer A Capture/Compare Control 2 */
#define CCR0_           TACCR0    /* Timer A Capture/Compare 0 */
#define CCR1_           TACCR1    /* Timer A Capture/Compare 1 */
#define CCR2_           TACCR2    /* Timer A Capture/Compare 2 */

/* TA3IV Definitions */
#define TAIV_NONE           (0x0000)    /* No Interrupt pending */
#define TAIV_TACCR1         (0x0002)    /* TACCR1_CCIFG */
#define TAIV_TACCR2         (0x0004)    /* TACCR2_CCIFG */
#define TAIV_6              (0x0006)    /* Reserved */
#define TAIV_8              (0x0008)    /* Reserved */
#define TAIV_TAIFG          (0x000A)    /* TAIFG */

 

/*-------------------------------------------------------------------------
 *   Timer1 A2
 *-------------------------------------------------------------------------*/


 /* Timer1_A5 Interrupt Vector Word */ 
__no_init volatile unsigned __READ short TA1IV @ 0x011E;  
 

__no_init volatile union
{
  unsigned short TA1CTL;  /* Timer1_A5 Control */ 
  
  struct
  {
    unsigned short IFG           : 1; 
    unsigned short IE            : 1; 
    unsigned short CLR           : 1; 
    unsigned short MC0           : 1; 
    unsigned short MC1           : 1; 
    unsigned short ID0           : 1; 
    unsigned short ID1           : 1; 
    unsigned short SSEL0         : 1; 
    unsigned short SSEL1         : 1; 
  } TA1CTL_bit;  
} @ 0x0180;


enum {
  IFG                 = 0x0001,
  IE                  = 0x0002,
  CLR                 = 0x0004,
  MC0                 = 0x0008,
  MC1                 = 0x0010,
  ID0                 = 0x0020,
  ID1                 = 0x0040,
  SSEL0               = 0x0080,
  SSEL1               = 0x0100,
};


__no_init volatile union
{
  unsigned short TA1CCTL0;  /* Timer1_A5 Capture/Compare Control 0 */ 
  
  struct
  {
    unsigned short TA2_CCIFG     : 1; 
    unsigned short TA2_COV       : 1; 
    unsigned short TA2_OUT       : 1; 
    unsigned short TA2_CCI       : 1; 
    unsigned short TA2_CCIE      : 1; 
    unsigned short TA2_OUTMOD0   : 1; 
    unsigned short TA2_OUTMOD1   : 1; 
    unsigned short TA2_OUTMOD2   : 1; 
    unsigned short TA2_CAP       : 1; 
    unsigned short TA2_SCCI      : 1; 
    unsigned short TA2_SCS       : 1; 
    unsigned short TA2_CCIS0     : 1; 
    unsigned short TA2_CCIS1     : 1; 
    unsigned short TA2_CM0       : 1; 
    unsigned short TA2_CM1       : 1; 
  } TA1CCTL0_bit;  
} @ 0x0182;


enum {
  TA2_CCIFG           = 0x0001,
  TA2_COV             = 0x0002,
  TA2_OUT             = 0x0004,
  TA2_CCI             = 0x0008,
  TA2_CCIE            = 0x0010,
  TA2_OUTMOD0         = 0x0020,
  TA2_OUTMOD1         = 0x0040,
  TA2_OUTMOD2         = 0x0080,
  TA2_CAP             = 0x0100,
  TA2_SCCI            = 0x0200,
  TA2_SCS             = 0x0400,
  TA2_CCIS0           = 0x0800,
  TA2_CCIS1           = 0x1000,
  TA2_CM0             = 0x2000,
  TA2_CM1             = 0x4000,
};


