SeanTheSheepCS/MSP430_SmallMotorCar/io430x21x2.h
__no_init volatile union
{
  unsigned short TA1CCTL1;  /* Timer1_A5 Capture/Compare Control 1 */ 
  
  struct
  {
    unsigned short TA2_CCIFG     : 1; 
    unsigned short TA2_COV       : 1; 
    unsigned short TA2_OUT       : 1; 
    unsigned short TA2_CCI       : 1; 
    unsigned short TA2_CCIE      : 1; 
    unsigned short TA2_OUTMOD0   : 1; 
    unsigned short TA2_OUTMOD1   : 1; 
    unsigned short TA2_OUTMOD2   : 1; 
    unsigned short TA2_CAP       : 1; 
    unsigned short TA2_SCCI      : 1; 
    unsigned short TA2_SCS       : 1; 
    unsigned short TA2_CCIS0     : 1; 
    unsigned short TA2_CCIS1     : 1; 
    unsigned short TA2_CM0       : 1; 
    unsigned short TA2_CM1       : 1; 
  } TA1CCTL1_bit;  
} @ 0x0184;




 /* Timer1_A5 */ 
__no_init volatile unsigned short TA1R @ 0x0190;  
 

 /* Timer1_A5 Capture/Compare 0 */ 
__no_init volatile unsigned short TA1CCR0 @ 0x0192;  
 

 /* Timer1_A5 Capture/Compare 1 */ 
__no_init volatile unsigned short TA1CCR1 @ 0x0194;  
 
 
#define __MSP430_HAS_T1A2__        /* Definition to show that Module is available */

 

/*-------------------------------------------------------------------------
 *   USCI
 *-------------------------------------------------------------------------*/


 /* USCI A0 Control Register 0 */ 
__no_init volatile unsigned char UCA0CTL0 @ 0x0060;  
 

 /* USCI A0 Control Register 1 */ 
__no_init volatile unsigned char UCA0CTL1 @ 0x0061;  
 

 /* USCI A0 Baud Rate 0 */ 
__no_init volatile unsigned char UCA0BR0 @ 0x0062;  
 

 /* USCI A0 Baud Rate 1 */ 
__no_init volatile unsigned char UCA0BR1 @ 0x0063;  
 

 /* USCI A0 Modulation Control */ 
__no_init volatile unsigned char UCA0MCTL @ 0x0064;  
 

 /* USCI A0 Status Register */ 
__no_init volatile unsigned char UCA0STAT @ 0x0065;  
 

 /* USCI A0 Receive Buffer */ 
__no_init volatile unsigned __READ char UCA0RXBUF @ 0x0066;  
 

 /* USCI A0 Transmit Buffer */ 
__no_init volatile unsigned char UCA0TXBUF @ 0x0067;  
 

 /* USCI A0 LIN Control */ 
__no_init volatile unsigned char UCA0ABCTL @ 0x005D;  
 

 /* USCI A0 IrDA Transmit Control */ 
__no_init volatile unsigned char UCA0IRTCTL @ 0x005E;  
 

 /* USCI A0 IrDA Receive Control */ 
__no_init volatile unsigned char UCA0IRRCTL @ 0x005F;  
 

 /* USCI B0 Control Register 0 */ 
__no_init volatile unsigned char UCB0CTL0 @ 0x0068;  
 

 /* USCI B0 Control Register 1 */ 
__no_init volatile unsigned char UCB0CTL1 @ 0x0069;  
 

 /* USCI B0 Baud Rate 0 */ 
__no_init volatile unsigned char UCB0BR0 @ 0x006A;  
 

 /* USCI B0 Baud Rate 1 */ 
__no_init volatile unsigned char UCB0BR1 @ 0x006B;  
 

 /* USCI B0 I2C Interrupt Enable Register */ 
__no_init volatile unsigned char UCB0I2CIE @ 0x006C;  
 

 /* USCI B0 Status Register */ 
__no_init volatile unsigned char UCB0STAT @ 0x006D;  
 

 /* USCI B0 Receive Buffer */ 
__no_init volatile unsigned __READ char UCB0RXBUF @ 0x006E;  
 

 /* USCI B0 Transmit Buffer */ 
__no_init volatile unsigned char UCB0TXBUF @ 0x006F;  
 

 /* USCI B0 I2C Own Address */ 
__no_init volatile unsigned char UCB0I2COA @ 0x0118;  
 

 /* USCI B0 I2C Slave Address */ 
__no_init volatile unsigned char UCB0I2CSA @ 0x011A;  
 
 
#define __MSP430_HAS_USCI__           /* Definition to show that Module is available */


// UART-Mode Bits
#define UCPEN               (0x80)    /* Async. Mode: Parity enable */
#define UCPAR               (0x40)    /* Async. Mode: Parity     0:odd / 1:even */
#define UCMSB               (0x20)    /* Async. Mode: MSB first  0:LSB / 1:MSB */
#define UC7BIT              (0x10)    /* Async. Mode: Data Bits  0:8-bits / 1:7-bits */
#define UCSPB               (0x08)    /* Async. Mode: Stop Bits  0:one / 1: two */
#define UCMODE1             (0x04)    /* Async. Mode: USCI Mode 1 */
#define UCMODE0             (0x02)    /* Async. Mode: USCI Mode 0 */
#define UCSYNC              (0x01)    /* Sync-Mode  0:UART-Mode / 1:SPI-Mode */

// SPI-Mode Bits
#define UCCKPH              (0x80)    /* Sync. Mode: Clock Phase */
#define UCCKPL              (0x40)    /* Sync. Mode: Clock Polarity */ 
#define UCMST               (0x08)    /* Sync. Mode: Master Select */

// I2C-Mode Bits
#define UCA10               (0x80)    /* 10-bit Address Mode */
#define UCSLA10             (0x40)    /* 10-bit Slave Address Mode */ 
#define UCMM                (0x20)    /* Multi-Master Environment */
//#define res               (0x10)    /* reserved */
#define UCMODE_0            (0x00)    /* Sync. Mode: USCI Mode: 0 */
#define UCMODE_1            (0x02)    /* Sync. Mode: USCI Mode: 1 */
#define UCMODE_2            (0x04)    /* Sync. Mode: USCI Mode: 2 */
#define UCMODE_3            (0x06)    /* Sync. Mode: USCI Mode: 3 */

// UART-Mode Bits
#define UCSSEL1             (0x80)    /* USCI 0 Clock Source Select 1 */
#define UCSSEL0             (0x40)    /* USCI 0 Clock Source Select 0 */
#define UCRXEIE             (0x20)    /* RX Error interrupt enable */
#define UCBRKIE             (0x10)    /* Break interrupt enable */                     
#define UCDORM              (0x08)    /* Dormant (Sleep) Mode */
#define UCTXADDR            (0x04)    /* Send next Data as Address */
#define UCTXBRK             (0x02)    /* Send next Data as Break */
#define UCSWRST             (0x01)    /* USCI Software Reset */

// SPI-Mode Bits
//#define res               (0x20)    /* reserved */
//#define res               (0x10)    /* reserved */
//#define res               (0x08)    /* reserved */
//#define res               (0x04)    /* reserved */
//#define res               (0x02)    /* reserved */

// I2C-Mode Bits
//#define res               (0x20)    /* reserved */
#define UCTR                (0x10)    /* Transmit/Receive Select/Flag */
#define UCTXNACK            (0x08)    /* Transmit NACK */
#define UCTXSTP             (0x04)    /* Transmit STOP */
#define UCTXSTT             (0x02)    /* Transmit START */
#define UCSSEL_0            (0x00)    /* USCI 0 Clock Source: 0 */
#define UCSSEL_1            (0x40)    /* USCI 0 Clock Source: 1 */
#define UCSSEL_2            (0x80)    /* USCI 0 Clock Source: 2 */
#define UCSSEL_3            (0xC0)    /* USCI 0 Clock Source: 3 */

